## Assignment 2 - Group 1 

First of all, we import the libraries to be used in this work:

In [1]:
import numpy as np
import pandas as pd

#### Question 1.4 - Pandas

1. Load Data:
   Load the financial data available at this URL:    https://raw.githubusercontent.com/datasets/finance-vix/main/data/vix-daily.csv
   Use `pd.read_csv()` and the link to load the data into a DataFrame.
   
We can do this simply with the following line of code.

In [33]:
df=pd.read_csv(r'https://raw.githubusercontent.com/datasets/finance-vix/main/data/vix-daily.csv')

It can be seen that the imported DataFrame is the following:

In [34]:
df

            DATE   OPEN   HIGH    LOW  CLOSE
0     01/02/1990  17.24  17.24  17.24  17.24
1     01/03/1990  18.19  18.19  18.19  18.19
2     01/04/1990  19.22  19.22  19.22  19.22
3     01/05/1990  20.11  20.11  20.11  20.11
4     01/08/1990  20.26  20.26  20.26  20.26
...          ...    ...    ...    ...    ...
8572  12/29/2023  12.55  13.19  12.36  12.45
8573  01/02/2024  13.22  14.23  13.10  13.20
8574  01/03/2024  13.35  14.22  13.33  14.04
8575  01/04/2024  13.93  14.20  13.64  14.13
8576  01/05/2024  14.24  14.58  13.29  13.35

[8577 rows x 5 columns]

2. Explore Data:
   a) Display the first five rows of the DataFrame.
   b) Display the summary statistics of the DataFrame.

To display only the first five rows of the DataFrame we use the `head` method as follows:

In [35]:
df.head(5)

         DATE   OPEN   HIGH    LOW  CLOSE
0  01/02/1990  17.24  17.24  17.24  17.24
1  01/03/1990  18.19  18.19  18.19  18.19
2  01/04/1990  19.22  19.22  19.22  19.22
3  01/05/1990  20.11  20.11  20.11  20.11
4  01/08/1990  20.26  20.26  20.26  20.26

To display a statistical summary we use the `describe` method as follows:

In [36]:
df.describe()

              OPEN         HIGH          LOW        CLOSE
count  8577.000000  8577.000000  8577.000000  8577.000000
mean     19.666454    20.474364    18.914884    19.580374
std       7.979066     8.439927     7.469827     7.906214
min       9.010000     9.310000     8.560000     9.140000
25%      13.940000    14.540000    13.400000    13.880000
50%      17.790000    18.470000    17.220000    17.760000
75%      23.100000    23.960000    22.320000    22.990000
max      82.690000    89.530000    72.760000    82.690000

3. Add Columns:
   a) Add a new column 'Level' that categorizes the 'Close' column values into 'Low' (< 20), 'Medium' (20-30), and 'High' (>30). You need to make a filter to make this categorization. You can see below some suggestions how to do it.
   b) Add a new column 'Year' extracted from the 'Date' column. You need to work with dates. You can do it directly workiwith the column splitting it or changing it to date format an dfollowing the below suggestion. 
   
We can use `pd.cut` as follows:

In [37]:
bins = [0, 20, 30, float('inf')]
labels = ['Low', 'Medium', 'High']

df['LEVEL']=pd.cut(df['CLOSE'],bins=bins,labels=labels)

The breakpoints of the classifier interval are specified in the `bins` list. The first interval is from 0 to 20, the second is from 20 to 30, and the last is from 30 onwards. The values of `df['CLOSE']` that are in the first interval will be classified within it and the same happens with the other values in other intervals. Finally, `Low` will be placed as a label if the observation was placed in the first interval, `Medium` if the observation was placed in the second interval, and `High` if the observation was placed in the last interval. This creates the required column called `LEVEL` (which is created using `df['LEVEL']=`). You can see it created in the following line:

In [38]:
df

            DATE   OPEN   HIGH    LOW  CLOSE   LEVEL
0     01/02/1990  17.24  17.24  17.24  17.24     Low
1     01/03/1990  18.19  18.19  18.19  18.19     Low
2     01/04/1990  19.22  19.22  19.22  19.22     Low
3     01/05/1990  20.11  20.11  20.11  20.11  Medium
4     01/08/1990  20.26  20.26  20.26  20.26  Medium
...          ...    ...    ...    ...    ...     ...
8572  12/29/2023  12.55  13.19  12.36  12.45     Low
8573  01/02/2024  13.22  14.23  13.10  13.20     Low
8574  01/03/2024  13.35  14.22  13.33  14.04     Low
8575  01/04/2024  13.93  14.20  13.64  14.13     Low
8576  01/05/2024  14.24  14.58  13.29  13.35     Low

[8577 rows x 6 columns]

Now, to create the requested year column, we first obtain a series in datetime format with the following command:

In [39]:
serie1=pd.to_datetime(df['DATE'])

Series1 contains in datetime format the string dates contained in `df['DATE']`

Now we extract the year from each date with `dt.year`

In [40]:
serie2=serie1.dt.year

And finally we create the required column using the years obtained.

In [41]:
df['YEAR']=serie2

4. Add Rows:
   a) Add a new row with a date of your choice and fill the other columns with appropriate values. 

First we look at the end of the DataFrame:

In [42]:
df.tail()

            DATE   OPEN   HIGH    LOW  CLOSE LEVEL  YEAR
8572  12/29/2023  12.55  13.19  12.36  12.45   Low  2023
8573  01/02/2024  13.22  14.23  13.10  13.20   Low  2024
8574  01/03/2024  13.35  14.22  13.33  14.04   Low  2024
8575  01/04/2024  13.93  14.20  13.64  14.13   Low  2024
8576  01/05/2024  14.24  14.58  13.29  13.35   Low  2024

We then create the following dictionary using values close to the last observation.

In [43]:
t=pd.Series(pd.to_datetime('01/06/2024')).dt.year # With this we extract the year from the date that we assign to this observation that we want to add.

r={'DATE':'01/06/2024','OPEN':[14],'HIGH':[14.5],'LOW':[13.5],'CLOSE':[13.9],'LEVEL':'Low','YEAR':np.float64(t)}

We use the dictionary to create the DataFrame of the new observation. Likewise, we apply an appropriate index.

In [44]:
new_row=pd.DataFrame(r,index=['8576'])

Now we add the observation contained in the previous DataFrame using the `append` method:

In [45]:
df=df.append(new_row)

We see that the observation was added.

In [46]:
df.tail()

            DATE   OPEN   HIGH    LOW  CLOSE LEVEL    YEAR
8573  01/02/2024  13.22  14.23  13.10  13.20   Low  2024.0
8574  01/03/2024  13.35  14.22  13.33  14.04   Low  2024.0
8575  01/04/2024  13.93  14.20  13.64  14.13   Low  2024.0
8576  01/05/2024  14.24  14.58  13.29  13.35   Low  2024.0
8576  01/06/2024  14.00  14.50  13.50  13.90   Low  2024.0

5. Analysis:
   a) Calculate the average of the column 'Close' for each 'Year'. You need to group for this task.
   b) Count the number of 'High', 'Medium', and 'Low'  Level days in the data.
   
With the `groupby` method we join the observations under the same year (introducing `['YEAR']` as an argument) and with the `mean` method we calculate the mean per year (only for the `CLOSE` column, which is achieved specifying `['CLOSE']`). In the following lines of code we do this:

In [47]:
avg1=df.groupby(['YEAR'])
avg1['CLOSE'].mean()

YEAR
1990.0    23.063478
1991.0    18.373373
1992.0    15.452047
1993.0    12.686245
1994.0    13.925516
1995.0    12.388770
1996.0    16.442165
1997.0    22.363984
1998.0    25.602976
1999.0    24.371912
2000.0    23.315000
2001.0    25.749677
2002.0    27.292460
2003.0    21.982857
2004.0    15.479644
2005.0    12.807063
2006.0    12.810320
2007.0    17.535936
2008.0    32.695534
2009.0    31.479008
2010.0    22.548889
2011.0    24.202579
2012.0    17.801640
2013.0    14.230119
2014.0    14.175992
2015.0    16.674087
2016.0    15.825635
2017.0    11.090239
2018.0    16.639841
2019.0    15.387540
2020.0    29.251304
2021.0    19.656151
2022.0    25.637148
2023.0    16.849027
2024.0    13.724000
Name: CLOSE, dtype: float64

Remember that we are only showing the average values that 'CLOSE' obtained for each year.

Now, to count the number of `high`, `medium` and `low` level days in the data we do the following:

We create a column of ones called N:

In [48]:
df['N']=1

Now we group according to `LEVEL` with the `groupby` method. Then with the `sum` method we obtain the total of ones for each `LEVEL`. Note that each one represents a day, so the sum represents the total number of days for each `LEVEL`

In [49]:
avg2=df.groupby(['LEVEL'])
avg2['N'].sum()

LEVEL
High       720
Low       5276
Medium    2582
Name: N, dtype: int64